
 // Оскільки 'number' - рядок, для рядків + - це конкатенація
 // Наступні значення сприймаються як рядки, з якими проводиться операція конкатенації
 // Результат - number33
let result_1 = 'number' + 3 + 3;
console.log(result_1); 

// Null - це нічого, залишається 3
// Результат - 3
let result_2 = null + 3;
console.log(result_2);

// Оскільки обидва значення в виразі - true, то нам повертається останнє значення
//Результат - "qwerty"
let result_3 = 5 && "qwerty"
console.log(result_3);

// + перетворює строку в number. Таким чином  +'40' = 40, +'2' = 2. Виходить сума чисел - 42. 
// Оскільки "hillel" - це рядок, то + стає конкатенацією рядків, зо перетворює 42 в рядок. 
// Результат - 42hillel
let result_4 = +'40' + +'2' + "hillel";
console.log(result_4);


//10 перетворюється з рядка в число, зоб виконати операцію віднімання.
// 10 - 5 = 5. 5 === 6 - це хибність, оскільки, хоча 5 та 6 це однакові типи, але мають різні значення
// Результат - false
let result_5 = '10' - 5 === 6;
console.log(result_5);


// true - 1. false - 0. 1 + 0 = 1
// Результат - 1
let result_6 = true + false;
console.log(result_6);


// Щоб виконати операцію віднімання, рядок '4px' конвертується в число. 
// Оскільки від не числових символів неможливо відняти, отримуємо тип Not a Number. 
// Резульат - NaN 
let result_7 = '4px' - 3;
console.log(result_7);

// Щоб виконати операцію віднімання, рядок '4' конвертується в число. 
// 4 - 3 = 1
// Резульат - 1
let result_8 = '4' - 3
console.log(result_8);


// Оскільки 6 - це рядок, для нього і наступного значення виконується функція конкатенації
// Залишається 63 ** 0. Будь-яке число в степені 0 повертає 1. 
// Резульат - 1
let result_9 = '6' + 3 ** 0;
console.log(result_8);

// Щоб виконати операцію ділення, 6 конвертується в число. 12/6 = 2. 
// Результат - 2
let result_10 = 12 / '6'
console.log(result_10);


// Оскільки 10 - це рядок, для нього виконується операція конкатенації (+)
// Вираз 5 === 6 хибний, бо числа не рівні. Він поверне false
// Резульатт - 10false
let result_11 = '10' + (5 === 6);
console.log(result_11);


// Оскільки порівняня не строге, то операнди прирівнюються до одного типу.
// Але пустий рядок не може бути null, a null - рядком. Вирази не рівні
// Результат - false 
let result_12 = null == ''
console.log(result_12);


//Всы дані одного формату. Виконуємо Спочатку в скобках - 9/3 = 3
// 3 в степені 3 = 27
// Резульатт - 27
let result_13 = 3 ** (9 / 3);
console.log(result_13);


//"!!" використовується, щоб перетворити щосб в булівське значення. 
// Отримуємо true == true,оскільки будь-який не пустий рядок є істиним значенням
// Результат - true
let result_14 = !!'false' == !!'true'
console.log(result_14);


//Починаємо з виразу "'0' && 1". Логічне і повертає перше хибне значення. 
// Оскільки "0" - це не пустий рядок, він є true. 1 також дорівнює true. 
// Хибних значень немає, тому повертається останнє значення. залишається 0 || 1
// || повертає перше істинне значення. оскільки 0 та 1 - це числа, а не рядки, то 0 - false, 1 - true
// результат - 1
let result_15 = 0 || '0' && 1
console.log(result_15);


// + перетворює null на число. При конвертації null в число отримуємо 0.
// отримуємо вираз 0 == false. Оскыльки порівняння нестроге, то значення прирівнюються до одного типу
// Отримуємо результат - true. Отримуємо вигляд виразу true < 1. 
// Оскільки true = 1, рівняння хибне, адже 1 не менше за 1
// Результат - false
let result_16 = (+null == false) < 1;
console.log(result_16);


// Виконуємо спочатку операцію логічного і через її пріоритет. 
// Нагадаємо, вона повертає перше хибне значення. ОТримуємо такий вигляд виразу: false || true
// Логічне або повертає перше істинне значення. В нашому випадку - це друге значення
// Результат - true
let result_17 = false && true || true
console.log(result_17);

//Виконаємо вираз в скобках. Логічне або повертає перше істинне значення, тому отримуємо такий вираз:
// false && true. Логічне і повертає перше хибне значення, в нашому випадку - це перше значення
// Результат - false
let result_18 = false && (false || true);
console.log(result_18);

// Виконаємо вирах в скобках. + перетворює null в число, тобто в 0. (0 == false) поверне true
// Отримуємо вираз true < 1 ** 5. 1 в степені 5 = 1. Вираз має вигляд true < 1
// Оскільки true = 1, вираз поверне false, бо 1 не менше 1 
let result_19 = (+null == false) < 1 ** 5;
console.log(result_19);



